[
    {
        "reviews": [
            {
                "review_text": "Having worked in the electronics retail industry for years now, I've seen scores of Smart devices come and go. Until now, nobody quite got it right. In the Echo Dot, Amazon has created a near perfect blend of hardware and software. I've seen plenty of the former, but truly seamless multi platform software has eluded everyone but Amazon. We're talking major players like Samsung and Google who have been at it for much longer than Amazon. The main problem is that excellent products like the Samsung Smart Things hub, which do a fantastic job of unifying a slew of different connected devices from different companies (Nest, Honeywell, Phillips, and so on), still lacked the web connectivity and entertainment support I wanted, so I'd still end up needing my tablet or phone. Thanks to fantastic third party support, the Dot has no problem controlling all of my smart stuff while allowing me to listen to music, order food, check the weather, listen to the radio, set alarms and timers, all of which is easily accomplished through simple voice commands. To me, this is the exceedingly rare product that I didn't know I needed, and now can't live without. Similar to the smartphone and tablet I use every day that didn't exist just a few short years ago. If you're even a little bit curious you owe it to yourself to give the dot a try. Add a good speaker and enjoy just how simple a connected life can be! Update: After a bit more time with the dot, or maybe I should say dots since I went out and bought another one for my living room, I've come up with a few tips. 1. Use the best speakers you can with it. I found that while Bluetooth was convenient I got much better sound out of my JBL duet computer speakers. 2. Take the time to voice train Alexa at least once. It's kinda tedious but really improves the accuracy. I've now gone through three trainings with each dot, the phrasing gets more intricate with each, and it really is amazing how much of an improvement it makes. Kinda hard to quantify, but I'd guess Alexa is at least twice as likely to understand long, complex phrases and has also gained noticeable accuracy when ambient noise I'd present. 3. If a phrase doesn't yield the results you're looking for, reword it and try again. For instance, \"Alexa, lower the temperature to 75 degrees\" got no result, so I tried \"Alexa, Honeywell Thermostat, 75 degrees\" and she picked it up perfectly. 4. Take the time to look through all the skills. There's a lot of helpful and just plain fun stuff in there, from strange facts to a calculator and everything in between, that really helps to enhance the experience. 5. I'd never really used my prime music prior to setting up my dots. Now I can't live without it! I can say basically whatever I want and I get a result. My favs so far: \"Alexa, play 90s music\", \"Alexa, play indie music\", and \"Alexa, play thunderstorm sounds\". The last one I ask to repeat and it plays all night. Really a great \"freebie\" if you're a prime member. 6. I was a bit worried initially that Alexa might be triggered accidentally by ambient TV or general household noise, so I'm really impressed that it's only happened twice so far. Both times in my living room when I was watching TV at high volume. If it's a concern, the mic can be temporarily disabled, so the dot won't trigger and listen accidentally. 7. I've had no problem pairing the dot to a variety of devices including: two different Bluetooth speakers, my Galaxy S7 edge, and pioneer receiver. I need to look into it further, but each time I paired my phone the Bluetooth connection to the speaker was lost, so I ended up having to listen to the built in speaker. Definitely not ideal for music, but no big deal if you're using wired speakers. Plus, most Bluetooth sets offer an auxiliary input for wired listening. 8. It's fun to ask Alexa general questions to see if she's capable of finding the answers. So far I've gotten accurate responses to \"Alexa, what's the definition of\", \"Alexa, how far away is\", \"Alexa, Wikipedia\" (just about anything you can think of and she'll tell you more if you ask \"Alexa, tell me more\"). If you have the time, ask her a set of questions and you'll quickly get used to her nuances. 9. Even though the microphones are extremely sensitive and quite accurate, I've found that the Dot works best when placed on a surface that's close to the level of the person speaking to it. Generally speaking, three to five feet off the ground. Alexa had some trouble hearing my requests when the dot was placed above or behind me. If you'd like to place the dot higher, it works much better when flush with the wall, instead of sitting on a shelf etc. I tried both setups and found with a couple nails set apart to make a cradle facing the dot out towards the room works best for me (sorry for the run on sentence lol). Suggestions for Improvement: 1. Unlike the upcoming Google Home BT speaker, the Dot and other Alexa devices are unable to answer general web queries. They do a decent job of answering factual questions like \"How far away is the sun\" but I'd really like too see Amazon add a \"search\" function. 2. Not Amazon's fault, but several of the news briefing skills update infrequently and volume levels vary enough that I'd find myself constantly changing the volume level to match. 3. I enabled briefings from several outlets like NPR, BBC, AP, and so on. I'd suggest you pick one or two and stick with them, otherwise you'll here the same news over and over. I ended up going with BBC and AP briefings.",
                "review_rating": "5.0 ",
                "review_posted_date": "24 Oct 2016",
                "review_header": "The Smartest of Them All!!! (Check out the video for a quick demo)"
            },
            {
                "review_text": "I am a prime member. This was my first purchase of Echo and I gave it to my mom who did not want it or think she needed it, haha I purchased Echo dot for 2 reasons, 1) I had wanted the original echo but thought the near $200 price tag was too steep so this price was perfect and 2) I wanted to get something for my mom that would open her mind to the power of technology and the need for change because ultimately I want her to have amazon fire tv because her monthly cable bill is insanely high but she has always been resistant to change. She had no wifi in her bedroom but I resolved that when I purchased TP Link AV500 Wi Fi Range Extender, Powerline Edition which did what no other wifi extender I purchased in past could do, gave my mom's room a secure wifi connection; apparently using already existing phone lines. All I know is that she now has wifi in her room. So I got Echo as a way to test her wifi connection with something cool. I easily connected Echo to TP-Link and it worked. We asked Alexa a few basic questions, We laughed a little but then I had to leave. When I returned the next day, I walked in and there was music playing (oldies but goodies) and I walked into my moms room and she was singing but was emotional. I asked her if everything was ok. She was in awe. She was happy. She was emotional because Alexa helped mom find songs at a blink of an eye that mom had not heard since her childhood and she demonstrated it to me. The speed that Alexa found the song and played it was mind-boggling. Mom was also planning a dinner in August and needed to know what day of week it was. She would normally need to leave her room and go to her main calender in the kitchen and find the date. But this time she just asked Alexa who gave her the information in like 2 seconds lol. TP-Link and Echo / Alexa have given my mom a whole new level of excitement, bewilderment, curiosity and wonder and we have only scratched the surface to the power of Echo. 2 more Echo dots are on the way as I type and more in the future i am sure. What a great gift to give to someone at a great price.",
                "review_rating": "5.0 ",
                "review_posted_date": "07 Jul 2017",
                "review_header": "Outstanding Price Point! An Emotional Moment and The Power of Alexa! - Ordering More Today"
            },
            {
                "review_text": "We bought an Echo Dot as an early Christmas gift to ourselves and we're so glad that we did. It's a very useful gadget because there's such a wide variety of things we can ask Alexa to answer or tasks that she can do for us (eg: alarms/timers, calendar, ordering, weather). Since one of the tasks that we wanted Alexa to do for us was play music, we subscribed to Amazon's Unlimited Music Plan for the Echo Dot. It's well worth the low monthly fee to be able to ask Alexa to play any song or album anytime, without having to buy all of them individually. ​Millions of songs are available through one groovy gadget (and the Unlimited Music Plan). We have the Echo Dot in our home and listen to music without any external speakers. As far as we're concerned, the internal speaker emits a decent array of sound. Is it as robust sounding as hooking it up to our surround system amplifier or other external speakers? Of course not, but it does sound a lot better than most internal device speakers of similar size. For those of you that don't like the internal speaker, you can utilize the 3.5mm or Bluetooth speaker options. If we say, “Alexa, Play The Top Songs by Phil Collins”... then that's exactly what she does. Keep in mind that when you ask Alexa for the \"Top Songs\" by a soloist or group, they may not always be your favorite songs. A work around for that is to ask Alexa to play a particular album that contains the songs you prefer to hear. The screen-shots show you how we asked Alexa to play an album vs the top songs. In addition, they show you what we see when logged-in to the Alexa app via the Chrome web browser. FYI: When asking Alexa to play an album that has a long title, we realized that she responds accurately when we ask for part of that title (view Elton John & Michael Jackson screen-shots). Be sure to look at what we said to Alexa vs what the whole album title is labeled. I should mention that we did ask Alexa to search for a product, which she did along with telling us the best options and their cost. Afterward, she asked if we wanted to buy the product. We said yes and she placed the order for us once we gave her our confirmation code (Settings: Voice Purchasing). We recommend setting that up so other people cannot place orders without your consent. It's convenient for us to have voice purchasing enabled when we're \"unplugged\" at night (except for Alexa). The skill that we use the most is Weather Sky, it gives us a detailed weather report that we use several times each day. ​At the time of this review, we haven't used any of the smart home features, but we didn't buy it for that purpose. PLEASE NOTE: We purchased the Echo Dot at its listed price, we did not receive any discount to post this review.",
                "review_rating": "5.0 ",
                "review_posted_date": "10 Jan 2017",
                "review_header": "> Millions of Songs Available Through One Groovy Gadget"
            },
            {
                "review_text": "Thanks for taking the time to read this review! This re-release of a critically acclaimed device is quite honestly a grand slam. Although slightly smaller then last years release, this device now picks up your voice even better! Im talking litterally talking leaps and bounds better. I can now say \"alexa\" and she hears me even when im downstairs or even when im blaring music thru my Harmon Kardon Onyx speaker. I found myself yelling at last years Echo dot and approaching the device wielding a kitchen knife attempting to get her to listen. We will be ordering a second device so we can try out its \"multi-room voice recognition\" technology. Amazon claims to have instilled a awesome feature where only one echo dot responds to your command if you have multiple devices. So bassically the dot closest to you awaits to the awake word \"alexa\" on a side note The basic Amazon Music Unlimited will only work on ONE of your devices. Not one at a time, but ONE. If you want to use it on more than one Dot or Echo, you have to purchase a \"multi-device\" plan: https://www.amazon.com/gp/dmusic/promotions/AmazonMusicUnlimited The main selling point of this device is you can use any of your exsisting bluetooth speakers to play your amazon playlist at a mild roar,or you can use the 3.5mm jack on the back to connect to your home theater and really give your ear drums a beating. (At your own risk of course). I have both the amazon tap and the echo. Unfortunately these devices have their flaws when it comes to audio reproduction.hence the bluetooth and the 3.5mm jack connectivity on this device will allow for the pickiest of listeners to appreciate their music thru exsisting devices. I will mention that the echo dot does have a very strong bluetooth signal so devices placed within a foot of this device had issues connecting. Once those bluetooth speakers were moved a few feet away they worked perfectly. The echo dot does have a built in speaker but it does sound tinny. It definitely works for light bedroom or kitchen use. At 50$ I was not expecting a whole lot. However amazon seriously went above and beyond to offer this incredible device at half the cost of last years model. And as stated above,it actually works better! I can also confirm that its connectivity with our in home smart devices. Works well with our TP Link smart plug so if I come home to a dark house, all I have to say is \"alexa turn on the lights\" and our downstairs lights spring into action. My only negatives were with the actual alexa app as it really gave me fits during setup only on my samsung s2 tablet. Spent a good 5-6 minutes and never got it to setup correctly. However the alexa app on my galaxy s6 phone found and paired the echo with ease. Just a weird quirk. Also Alexa still has her quirks. unless you phrase some questions correctly she still responds with \"sorry I didn't get that\" Alexa is still a developing search engine so My hopes is that she will continue to grow as even more users jump onto these incredible amazon devices.Prime music is our prime application and hence this device meets our expectations. Another thing to mention is the echo dot will not play your iTunes or google play music as of now. Those 2 companies are releasing devices of their own so as we all know they will push their own devices rather then make them compatible with a competing companies device. Amazon Prime music is a great added benefit for those of you that are existing Prime users so this device works well in giving you access to all of your \"free\" music. I did a unboxing and setup and show you how this device works video on youtube. Just look up \"New Amazon echo dot 2nd gen 2016 release Unboxing\" under my channel LMMProductions to see this incredible device in action. I will continue to update this review as I spend more time with this device.",
                "review_rating": "5.0 ",
                "review_posted_date": "24 Oct 2016",
                "review_header": "A huge improvement over last years release and for half the price"
            },
            {
                "review_text": "Whether you just want the weather, latest sports scores or help with a math problem, Alexa will help. We now have 3 in the house and will be adding two more. With a simple $3 subscription to Amazon's music service, you can stream almost any music you can think of by simply asking Alexa for it! Perfect work with my meidong QQ Chocolate bluetooth speaker, I also recommend this speaker Meidong Universal Water Resistance QQChocolate Portable V4.0 Wireless Bluetooth Speaker with 10W Dual Driver and Built-in Microphone And use this code for less $5: GHAQE5YF(I got it from somewhere else.) For the paranoid - this device is NOT for you. The echo dot is always listening and while the design is supposed to only listen when you say the name of the device (Alexa, Amazon or Echo - your choice), there are enough times that I hear one in another room say \"sorry, I did not understand the question\" to tell me it misunderstands these prompts to have been said when they weren't pretty often. + Good product support + Good voice recognition + Because of the size it doesn't stand out like a sore thumb in a room - Doesn't differentiate between voices. If you keep it closer to a speaker than you are, then it will sometimes get confused and start picking up words from both the speaker and you when commands are given. Placement of dot is crucial for a good experience. - Only supports english and german for now - Not very competent at answering general questions and you need to activate skills to expand this functionality. This makes asking question less intuitive since you then need to use commands like \"Alexa, ask wikipedia....\" - If you have smarthome devices named the same as internal functions, it will get confused at times. This may require renaming of the smarthome devices.",
                "review_rating": "5.0 ",
                "review_posted_date": "01 Jun 2017",
                "review_header": "Alexea & Bluetooth speaker"
            },
            {
                "review_text": "***** ECHO TIP For an Inexpensive GREAT AMAZON MUSIC SYSTEM: Pair an Echo Dot with the VERY HIGH-QUALITY TaoTronics Bluetooth Portable Stereo Speaker, costing $50, and you will have a KICK-AZZ micro sound system. Music from Echo sounds great coming thru the TaoTronics speaker. That's my Amazon Music system. Check out my photo. Plus, I still use the PORTABLE TaoTronics with my Note 8 to hear music when lounging on my back porch. You can find the TaoTronics at: https://www.amazon.com/gp/product/B013WPIGUA/ref=ox_sc_sfl_title_10?ie=UTF8&psc=1&smid=A2KUZVNQ9LP7N9 (PS: Buy this better older model, not the new cheaped-out TaoTronics model.) *************************************************************** I was skeptical about the usefulness of the Echo products until my wife bought a pair last week. Now I consider the Echo Dot to be one of our best tech purchases of 2017. Also, I am buying two more Echos for other rooms. Here's why! PROS: 1. HOME INTERCOM SYSTEM: I live in a 3-story home with my office on the third floor. I always wanted a home intercom system to avoid running down the stairs to speak with a family member. The high expense of wiring my house for an old-fashioned intercom system prevented that dream. HOWEVER, the Echo Dot creates an inexpensive, effective intercom system. I love the intercom feature called 'Drop In'! 2. EASIEST WAY TO CREATE REMINDERS, ALARMS, TIMERS, & TO DO LISTS: My Samsung Note was my solution for creating alarms & reminders. The Note was effective but not flawless and subject to user error (like forgetting to charge the Note or leaving it in the wrong room). I love telling Alexa to set my reminders and alarms...because she never forgets to alert me! 3. BEST WAY TO ENJOY AMAZON MUSIC: My Samsung Note was my primary way of listening to Amazon music...but that meant using & carrying around headphones or a Bluetooth speaker...even when working in my home office. NOW Echo frees me from the burden of using extra devices. An Echo Dot connected to a good speaker -- either wired or Bluetooth -- is now my favorite music system. 4. GREAT CONNECTIVITY WITH SMARTPHONES & BLUETOOTH DEVICES: Echo easily paired and quickly connected with my smartphone and Bluetooth speakers. 5. EXTREMELY EASY TO OPERATE: There is really no learning curve to effectively using the Echo. It is the purest 'Plug & Play' tech device that I ever used. Heck, my 73-year old mom figured it out in a few minutes (and it took me months to teach her how to use a smartphone). 6. MANY, MANY OTHER GREAT FEATURES: After one week of using Echo, I've only scratched the surface of what it can do. It is like an adventure learning how to work with Alexa. That appeals to the Tech geek in me. NEUTRAL: 1. USING ECHO TO CALL CELL PHONES: It is not a bad feature but is it a very useful feature? The person you are calling must have the Alexa app installed on their smartphone. Hoo-kay Doo-kay, try convincing family and friends to install an unfamiliar app on their smartphones just to get a call from you! Like, why bother? Really. It is still easier to make calls by the 'old-fashioned' way. 2. Lots of Frivolous Features: I really don't care if Alexa can tell jokes and do many other frivolous things. But, no big deal...because it is easy to disregard useless features. CONS: None. Seriously. I don't have one single serious complaint. The VERDICT: At $50 apiece, the Echo's features, functionality, and usefulness makes it a tech device worth buying.",
                "review_rating": "5.0 ",
                "review_posted_date": "28 Sep 2017",
                "review_header": "BEST ECHO SO FAR! Plus Super System for Amazon Music."
            },
            {
                "review_text": "My Amazon Echo Dot does not require the user to enter pairing mode to connect to the device via bluetooth. I live in an apartment complex - two of my neighbors have connected to my echo dot without any input on my part. The dot appears as a pairable bluetooth device at all times. This is a major security flaw, considering that this devices is connected to my network and my amazon account, and is listening at all times. I will be keeping this device unplugged until this flaw is fixed.",
                "review_rating": "1.0 ",
                "review_posted_date": "05 Feb 2017",
                "review_header": "MAJOR SECURITY FLAW"
            },
            {
                "review_text": "NEEDS security! Anyone in range of this things Bluetooth can connect and start playing music or speaking through this thing on cell calls. First few times I started hearing random voices in my living room, I was a bit weirded out, because I had no idea where they were coming from. Then one day, I heard Alexa announce that a bluetooth device had connected, so I opened the app and discovered numerous devices, that weren't mine. After kicking them all off, I attempted to find some kind of security protocol to keep out unwanted connections, but soon discovered that there wasn't any. Now, I get to randomly hear other voices or music start playing, in the middle of the night, anytime the people in the apartments behind me decide they wanna screw around. Other than that, the thing's works pretty well. Some of the functionality, like the particular nature of commands, takes a little getting used to, but about 99% of the time, it understands perfectly. Until amazon decides to add, what should've been a no-brainer, security feature, I cannot give this thing a good rating. The fact that anyone can be woken up in the middle of the night, by a random person connecting to their device, is ridiculous. Fix it.",
                "review_rating": "1.0 ",
                "review_posted_date": "14 Feb 2017",
                "review_header": "NEEDS SECURITY!!!!"
            },
            {
                "review_text": "4/5/2018 Update. Got a call from Amazon's quality control/product feedback staff today to talk about my review and get some feedback. Had a good conversation. I look forward to seeing if they provide ways to opt-out from Alexa's repeated sales pitches and other future potential improvements in their Echo products. Will update my review when those improvements arrive. Love our Amazon echo, so I got a dot or two... and now Alexa is constantly harassing me like a salesman that just wont shut up telling me over and over that I need to buy the \"family\" music plan so that we can listen in multiple rooms at once. I love the compact aspect of this product. I love the Alexa software in general. I haaaaaaate that Alexa will not shut up and is constantly asking me and other family members if we want to buy more services. Amazon, you just became an irritating duchebag salesman. I want the option to turn off any sales offer on Alexa, especially since it sounds like my kids can easily accidentally agree to purchase subscription services Alexa is constantly pitching us. I am fine with only being able to play prime music in one room at a time but for pete sake make it easy to do. Do not force me and my family to listen to this incessant sales pitch over and over. Give us the option to say \"no\" and be done with it. I admire salesmanship but you've stepped over into duchebaggery. I am in offline and online sales, I've generated millions from my own SaaS services, I get it... you're just being a duchebag about it.",
                "review_rating": "1.0 ",
                "review_posted_date": "04 Apr 2018",
                "review_header": "The echo dot turned Alexa into a duchebag salesman."
            },
            {
                "review_text": "I got some smart plugs so that I could turn on inside lights if we come home after dark with the app on my phone. My 82 y.o. Dad lives with me & has a hard time walking & he's also losing his ability to see at all in the dark, because of Macular Degeneration. So the last thing I need is him tripping over something in the dark, trying to turn lights on!! I have an Echo & Dot in my room, which I mostly use to stream music with my Amazon Music Unlimited. I was controlling even his bedroom light & the hallway light with the app on my phone as well as my Echo. So I bought two more Dots during prime day sale. It's been a game changer!! My Dad struggled, even with the app on his phone to control the lights. Now that we have a Dot in his bedroom & an Echo & Dot in the living room, he's very easily learned how to ask Alexa to turn on the hallway light, his bedroom light when he's going to bed!! NO MORE STUMBLING AROUND IN THE DARK or trying to remember where he put his flashlight!! Since the Echo Dots all sync together, once he gets to his bedroom, he tells Alexa to turn off the living room light & the hallway light when he gets to his bedroom!! This little device is a SAVING GRACE, not only for my Dad, but for me!! I don't have him calling me to \"Show me again how to turn the lights on/off\" with his phone app!! It's like having someone else here that helps me take care of my Dad!! I made a list of the commands for the lights, etc & hung one on his night stand & put the other beside his chair in the living room!! He's also exploring, BY HIMSELF, different commands for Alexa. I've heard him ask her about the weather, baseball scores, etc. THIS LITTLE ITEM IS A TRUE GEM FOR SENIORS!! I love mine just as much & the quality of the sound thru the Echo is AMAZING for listening to music. I'm VERY PICKY about sound quality!! I have Bose speakers hooked up to my TV & have Bose ear buds as well. The quality of the sound from the Echo is just as good as Bose speakers!!",
                "review_rating": "5.0 ",
                "review_posted_date": "20 Jul 2018",
                "review_header": "AWESOME FOR SENIOR CITIZENS!!"
            },
            {
                "review_text": "UPDATE: apparently u get charged if u activate music. Not only the monthly charge but every time u play music? I canceled when I saw the charges the first time but then I got charged again (over the next several months). The customer service couldn’t tell me exactly what the random charges were other than they were echo charges. I don’t like surprise charges. I feel like we should be able to activate services and not have them automatic or easily activated without knowledge. Apparently if you ask Alexa to play music, and it’s not free, you won’t know and will get charged. AMAZON STAFF: This needs to be fixed! ZERO stars if I could. I really love this dot. It’s my first Alexa product. I ordered two and finally put up the 2nd one later, in our living room. I haven’t explored ALL features but i was pretty excited about the “Drop in” feature... BUT it wasn’t that great. The sound is horrible. I dropped in from my bedroom to the living room and it sounds like a bad phone call on speaker where reception keeps cutting in and out. :( I wanted to purchase the Echo’s with a screen but I’m worried the sound will be just as bad! For other uses, I’m loving it so far! Bummer about the drop in feature. I was hoping to use this feature often to call home to talk to my son when I’m at work to check on him...",
                "review_rating": "1.0 ",
                "review_posted_date": "17 May 2018",
                "review_header": "Not a fan anymore. hidden charges."
            },
            {
                "review_text": "Buyer Beware!!! We bought an Echo in Nov of 2016 and we bought a Dot shortly after. We subscribed to the Unlimited Music service. We were able to play any Amazon music we wanted on either of the Echoes and have different music streaming to both at the same time. We added more Echo Dots in other rooms so my wife and I can listen to different things in different rooms all over the house. We have had this setup for months. We would put music on for our young kids while they slept and listen to something else in the kitchen while we talked. Well, all of a sudden on August 29th we lost the ability to stream to more than one device unless it was the same stream using the multi-room playback feature. We thought this was a bug since it happened on the same day they rolled out multi-room playback. It turns out that it is not a bug and they made the change on purpose. The multi-room playback ONLY allows you to listen to the same music stream on multiple devices. We can no longer play music for the kids and listen to our own stuff. In order to return this functionality, we are being told we must subscribe to the Unlimited Family plan. Well, here is the kicker, now you must pay for Prime and the Unlimited Family Music plan in order to use more than one Echo at a time which means you are paying an extra $70 a year above the Unlimited Music plan for a total of $248 a year to use multiple Echoes in a single home if you want more than one playing at a time with a different Amazon stream. You could try to use the other streaming services that the Echo supports for a combination of streams running on other devices but to get commercial free those cost money too. Oh, and don’t get me started on how kids under the age of 13 are not even allowed to use the Unlimited Family Music Plan…great planning on the feature removal Amazon. No we shouldn’t have to lie about our kids age to get what we want. We never would have bought the other Echoes had we known they would change the way the service works. Limiting a product after they have been purchased is a complete rip-off. I’ve never owned a product before where major features are removed instead of added. We were not given any warning nor any compensation for the change. Now we have a bunch of useless Echoes all over the house. Well, not completely useless, they have been reduced to hockey puck looking alarms clocks and timers. I’m currently looking into the cost of moving to Google Home. We will also be significantly reducing our spending on Amazon. You have been warned.",
                "review_rating": "1.0 ",
                "review_posted_date": "03 Sep 2017",
                "review_header": "Bait and Switch!!!!"
            },
            {
                "review_text": "This is the second Echo Dot for our household. The first I got last year as a Christmas present. We LOVE it. We use it to stream music from our playlists, to set timers, to ask questions and about the weather, and especially for the shopping list. My kids can add stuff to the list while I'm at the store and my list in the Alexa App updates to show it! I really think that was my (personal) favorite feature with ONE Dot. With TWO Dots it's even better. My daughter has the only room upstairs, and she's the one that does most of the music streaming. So I bought her this Dot for Christmas. She can now stream her music by voice command. I also no longer have to scream at the ceiling or walk across the house to get her attention. I just say, \"Alexa, call upstairs.\" and bam, my daughter and I can speak normally. I also use it to make sure she's up in the mornings, I just tell Alexa to play wake up music upstairs. My daughter actually made a playlist called \"wake up music\" of songs she'd like to hear to wake her up, but I usually forget to add \"playlist\" to my request and Alexa always manages to find suitable songs. Many my daughter added to the wake up playlist in the undying hope that one morning I might possibly remember to say the word playlist to Alexa. Now my son is lobbying to get his own \"Alexa\" for his room....",
                "review_rating": "5.0 ",
                "review_posted_date": "11 Jan 2018",
                "review_header": "The more, the better..."
            },
            {
                "review_text": "update for the THIRD ONE they sent me!----2nd gen has lots of problems at Amazon's end. first 2 didn't work. After 20 minutes on the help line they admitted they have a HW problem and are going to send me another (groan! - give me a 1st gen!) The third one also would not connect to my U-verse wi-fi (my 1st gen in the kitchen workes fine and was a breeze to set up). So, another 20 minutes on the phone with amazon and it finally connected to my wi-fi. However, when I put it in my master bath it would not connect. I had to swapp it with my working 1st gen from the kitchen and then they finally both worked. That's really weird because my kitchen is farther away and has more walls between the dot and the router, so moving the 2nd gen dot FARTHER away actually made it work. I'm an electrical engineer and I can't explain that .....",
                "review_rating": "1.0 ",
                "review_posted_date": "08 Sep 2017",
                "review_header": "2nd gen has lots of problems ...you might want to buy a 1st gen dot instead..."
            },
            {
                "review_text": "You need an iphone (and only an iphone) to setup drop-in for an echo dot and an echo on the same wifi. Why? A $700 device to connect two sub-$100 devices to each other through an app that already recognizes, that's ridiculous. They don't use the cellphone to make a call to each other, that would require two cellphones because a single cellphone would have to call and answer at the same time. The ipad sees the devices along with the dash wand and fireTV. All of the Alexa devices should be automatically in the contacts and talk to each other via their IPs on the same LAN. I was planning use four more echo dots as an intercom system in the house, that is not going to be happening until the Alexa app can set up Drop-in on any device the app runs on. Also all my contacts' info should not be required to connect Alexa devices on the same local network.",
                "review_rating": "1.0 ",
                "review_posted_date": "23 Jul 2017",
                "review_header": "You need an iphone (and only an iphone) to setup drop-in"
            },
            {
                "review_text": "At the suggestion of a friend, I decided to try the Alexa Echo lifestyle. At first, I could not imagine what I would use it for. Why the heck would I need to ask Alexa to do anything for me??? Well, I bought the Echo Show along with an Echo and and Echo Dot. I was immediately hooked! I began with smart plugs, then some smart bulbs. Then I bought an Echo Plus, the one with the hub. After figuring it all out, I ended up returning the Echo Plus and I bought 3 more Echo Dots. With two of the Dots, I bought MOKCAO POWER+ Cordless Speaker with Battery Base for Amazon Echo Dot 2nd Generation (https://smile.amazon.com/gp/product/B0749K9C1T/ref=oh_aui_detailpage_o07_s00?ie=UTF8&psc=1)' I found that this speaker with a Dot gave me as good or better sound than having a full Echo or an Echo Plus. The bonus is that each of them is portable so I can take it anywhere and treat it as a bluetooth speaker. The 3rd Dot is now hard wired to my 7.1 Suround system in my gameroom and the 4th wired to my Bose Wave Radio in my garage. So, as you can guess, I'm all in with Alexa. The Dots are great if you can hook the up with a speaker as i have done with two or a stereo system as I have with the other two. The Echo Show is the one we have in our morning room, the room we spend 90% of our time. The reason is that it has very good sound quality all by itself and the screen is great for seeing lirics of songs. But it best for linking your photos up to Amazon Photos and playing all of your photos like a digital picture frame. I plan to use this same review for all of the Echo products I am now enjoying, Echo Show, Echo, and 4 Echo Dots. Even my wife is asking Alexa to play her music and that is a complete positive testament. Oh, did I mention that I set up an \"everywhere\" music group so I can now have music playing throughout the house. I can also ask Alesa to turn on the Livingroom Lights, Deck Lights, Bar Lights, Gameroom Lights, Office Light, Bedroom Light",
                "review_rating": "5.0 ",
                "review_posted_date": "25 Feb 2018",
                "review_header": "Just part of the total Smart Home Echo package."
            },
            {
                "review_text": "I bought 2 of these in October of 2017. One for my mother who had 2 strokes and 1 for my home. The one for my home I had an interest in mainly streaming music as I work from home and thought I would use it in my office. I also bought 2 Harmon Kardon speakers. Initially setting it up I had no problems and gave it a 4 star review. Mainly because you can not hard wire the device to internet connection as well as the lack of a music app on the alexa app and the difficulty in getting Alexa to play songs from your Amazon music library. Very shortly after the review I started having issues with the device not being able to stream music and stopping in the middle of songs, not being able to understand me.And constantly losing its connection. I called support which was fantastic and ran me through a series of tests. They recommended that I open some ports on my modem. I open the ports, reset the modem and the same problem persisted. I called my internet provider and they came to my home installed a new modem, new fittings.Still the echo will not stream music. Constantly flashing red, saying it lost its connection. Pausing for up to 2 minutes in the middle of a song. All this while my Fire stick streams music non stop upstairs on the same Wi-Fi connection. Multiple calls to support resulted in more Modem resetting, faster internet, new modem.. Meanwhile every other device in my home was performing fantastic. I did consider maybe I had a faulty device so I bought another, plugged it in and Same thing..could not play one song with out stopping losing connection. So I just started using my phone to stream music and absolutely no problems streaming music. The Harmon Kardon Speakers are the highlight of this story as they sound absolutely AMAZING connected to everything besides the Alexa Dot. I honestly can not believe the amount of time and energy I spent trying to trouble shoot this device. I only wanted it to do the most basic thing and simply stream music. I was so frustrated with it, I actually opened my front door and threw it in the garbage can outside. Exactly where it belongs. I would honestly not recommend this device to anyone as it performs horribly. I will say Amazon support is great, they did try to help me each time I called and with the exception of one rep saying he would call me back who never did, all the support were great. On my final call about the device today I spoke to a manager who offered me a refund on the device and was very professional. I still honestly feel that the entire experience is a 1 star experience. The most infuriating thing was when the Alexa would fail i would use a 5 yr old first gen Samsung Tablet the whole family uses and it would stream music perfectly from the same Wi-Fi connection. Maybe if these were able to be hard wired to a connection they would be good, but the device as it is has a very hard time connecting even when just a few feet from the modem. I tried absolutely everything to get it to work until it became painfully obvious that the easiest solution was to throw it in the garbage and simply use the devices I already have to stream music. The voice control is nice but I would much rather be able to listen to the entire song. I have purchased a total of 3 of these. My mother uses hers a little bit and it works. I have another here and it does the same thing as the one I threw in the trash. So I just use it to control my fire stick. It will do those simple tasks but if try to use it to stream music it fails.",
                "review_rating": "1.0 ",
                "review_posted_date": "01 Nov 2017",
                "review_header": "Months of trying to get it to work...threw it in the trash."
            },
            {
                "review_text": "There's already a ton reviews for the Amazon Echo, but I just wanted say how happy we are with this product. I initially thought that I should get the regular larger speaker Amazon Echo for our living room/kitchen for the first floor of our 2- level condo and because it's a larger room than our bedrooms upstairs; however, when the Echo Dot went on sale for $40, I thought it was a really good value over the more expensive big brother and too good to pass up. What I found was that the Echo Dot was perfectly sufficient for the first floor. It's hard to know if the sound will be loud enough or if Alexa could hear from all parts of the room just by seeing it at the retail store, but Alexa (Echo Dot) had no problems hearing and responding to our commands. We typically set the volume setting to volume level 7 and music is loud enough for us to hear everywhere. It helps to have it centrally located in the room, and I am no farther than 20 feet away from the device speaking at relatively normal voice volume. My wife, an initial skeptic, is really surprised by how smart the Echo Dot is, and my kid loves it as well. The only thing that is CON for me is that the Amazon Echo \"skills\" that can be learned still feels like in the infant stages and many of the \"skills\" not as polished. Certainly there are several companies that have helped designed some really good skills like Capital One, Fitbit, and Domino's, but there's still not a lot to choose from. I hope that more and more companies will jump on this quickly. Considering everything, for $40/$50 bucks this is a great value and easy way to get yourself introduced to home automation and voice recognition technology, and overall, I would highly recommend this product. The product comes in a small package, and everything that comes in the box can be seen in pictures attached.",
                "review_rating": "5.0 ",
                "review_posted_date": "14 Dec 2016",
                "review_header": "Speakers Are Perfectly Fine For Our Living Room & Kitchen"
            },
            {
                "review_text": "So, I fired Siri today. I'm not sure she understood, for she has never understood me. So, we did an 'uncoupling'. She didn't take it well, especially when she found out about Alexa, she somehow was back stalking my phone. Siri even tried to overpower Alexa, setting herself to a default setting, I never knew exsisted. I tried explaining that Alexa really listens to me, understands my wants and needs, even tells me jokes! Again, Siri said she couldn't understand me. As Alexa and I grew in our new relationship, she now takes care of most of my needs. She turns on my outside lights, she tells me if I need to leave for work earlier, due to weather. I can ask her if my flight is on time at the airport and how long it will take me to get to my destination. Alexa even likes hockey! She knows all the current trades and rosters, can record my favorite team on tv and remind me to watch it. Also, since I don't like the tv announcers, I can ask Alexa to stream the radio broadcasters for the game instead and she will even mute the tv. She did tell me, she can vacuum for me, but my current roomba doesn't except her calls, maybe the roomba will eat another sock and can break up with him, introduce new roomba to Alexa. Maybe I'll ask Alexa to make me some money and smart home my whole house! After several failed attempts to evict Siri, I think she finally gave up and been a peaceful few weeks of lazy bliss. I sit on my couch, Alexa orders me take out, she checks to make sure garage door is closed, doors are secure (one door really, again that money issue) she 'drops in' the kitchen echo to help kids check math homework. If anyone wants something at home that actually listens to you and does what you ask, Alexa is your girl. She's so much more than music and temperature checks. With a little fun research, your ex Siri will be green with envy at all Alexa can do. Also, many of her skills can be downloaded free or cheap, adding smart outlets and such are not too bad of a price either.",
                "review_rating": "5.0 ",
                "review_posted_date": "24 Feb 2018",
                "review_header": "Divorced Siri"
            },
            {
                "review_text": "Decided that it worked so well that it needed and stylish makeover. So I secured it on an old radio box and the wooden box make the speakers so much more vibrant and the box I have lets me have all the buttons.",
                "review_rating": "5.0 ",
                "review_posted_date": "21 May 2017",
                "review_header": "Echo Makeover"
            },
            {
                "review_text": "Omg! We love this thing! My husband is tech challenged so smart phones, computers are not an option. I bought this for Christmas present. I also bought wifi plug to use with it. He was having major surgery and not supposed to get out of bed in the dark. I put the Dot in bedroom and he just tells Alexa to turn on the light. The biggest challenge was getting him to use Alexa name before giving the request or not say Alexis. Ha! He just isn't able to use tablet I also bought for Christmas. I was so pleased he can tell Alexa to play his favorite Christian radio station. He checks the time and temperature 100 times a day. I'm very pleased with sound quality and volume for such a little, inexpensive product. I'm a stickler about sound quality. He is much better, so the baby monitor I used is turned off. I needed him to be able to call me if he needed me, which is difficult since he still has limited movement. I got emails about Alexa and you can call phones and drop in on other devices just by asking Alexa! I got the Alexa app for my iPhone and he can call me by telling Alexa and I can drop in on him and make sure he's good. He doesn't want a phone near him for obvious reasons. It is perfect for us to keep in contact without using a phone. Unfortunately he can't get the hang of using his new Fire tablet, but I can! I'm a diehard apple user, but the quality of tablet and Echo are awesome. And Fire TV, all have Alexa! When you get them they are ready to go. Just turn them on. Apple products are so expensive. I'm just amazed at what Echo can do for hundreds of dollars less. As my hubby says to Alexa, \"Thank you\" ❣️",
                "review_rating": "5.0 ",
                "review_posted_date": "25 Mar 2018",
                "review_header": "Amazing helper after hubby's surgery"
            },
            {
                "review_text": "What more can I say that people don’t already know? It amazes me that while Apple ran with Siri and Microsoft battled them by offering Cortana... that Amazon snuck up and beat them both at their own game. I use Echo to it’s fullest. Adding calendar events, to-do stuff, controlling the lights and heating in my house, etc. I got a second unit that is wall mounted in the master bathroom so I can get my news updates in the morning and shout out songs I want to hear from the shower. Did I mention the games and interactive stories? Last winter my family sat around the fire running Alexa through her paces. Can’t wait to see what’s next!",
                "review_rating": "5.0 ",
                "review_posted_date": "27 Sep 2017",
                "review_header": "Had to get more than one!"
            },
            {
                "review_text": "Simply doesn't connect with other \"smart\" devices. The Dot sings, plays music, and will tell you jokes but all this bit about how it will control other devices is apparently just hokey. I tried it with Phillips Smart LED Bulbs and apparently the bulbs are not enough. You need an expensive \"hub.\" If the Echo Dot isn't a hub, why not? I don't need a dozen hockey pucks plugged into every outlet in the house in order to control a couple of lamps. I also bought the TP Link smart plug hoping that would work with Echo. Once that was installed and its own Kasa iPhone app downloaded the TP Plug worked just fine with its own app. But Echo couldn't discover it. What do I need an Echo for if it won't control the TP Link plug?? I will keep the plugs and use the iPhone app to control the lights (along with the traditional wall switch which works just fine.)",
                "review_rating": "1.0 ",
                "review_posted_date": "08 Dec 2017",
                "review_header": "The Device that Nobody Needs"
            },
            {
                "review_text": "Works great! You can set it next to your bed and use it for an alarm clock as long as it is linked to the internet. You can tell it to play what ever music you like to sleep by and for how long or you can set it to play a thunderstorm or rain sounds or the sounds of waves at the beach! You can set it to give you a brief up date of the news and weather and traffic through Reuters online. Of course you can order accessories like lights and other gadgets that it will control remotely at your command. This speaker doesn't get loud like the echo but it is quality sound. It's limited on the information it can give out. I asked it to recite the preamble to the constitution and it ponied right up but I asked it to recite the Gettysburg address and it couldn't do it...just that it was a 3 minute speech given by President Lincoln. Well worth the money...can't see anybody going wrong with this.",
                "review_rating": "5.0 ",
                "review_posted_date": "25 Nov 2017",
                "review_header": "Works great! You can set it next to your bed ..."
            },
            {
                "review_text": "Edit to add a big plus: Alexa can make hands-free phone calls. She can't call 911, but can call other numbers. This could be huge in a medical emergency especially for those who live alone. \"I've fallen and I can't get up.\" LOL, but not funny, really. I'm surprised the Dot isn't advertised as a medical alert device (despite not being able to directly call 911). I received the Dot yesterday and I'm loving it so far, and still learning all the things she can do with the many available added \"skills.\" Three points I'd like to make--the internal speaker is better than I expected (at least as good as a phone or laptop), so external speakers aren't as essential as I'd been led to believe. She's perfectly usable right out of the box even for music. Another thing is it functions pretty well with slow internet. Right now it's playing an Elvis song after a request for classic rock n roll music. You can ask her what the name of the song that's playing is, and she will tell you. The third thing is that Alexa is much better at understanding regional accents than Siri is, plus Alexa can do so much more. I'll leave the other details to the many excellent existing reviews. I ordered it while the Christmas sale was on, for $29.99--worth that simply to use as an alarm clock, check the weather forecast, and play music. The next day I ordered another one which should arrive tomorrow. A steal at $30. and well worth the regular price of $49.99 imo. I have the first one (white) in my bedroom, and will try to connect the second one (black) to the speakers that are connected to my TV in the family room. It even looks good--like a little flying saucer with its circling lights. I'm now wishing I'd given a few of these with my other Christmas gifts.",
                "review_rating": "5.0 ",
                "review_posted_date": "03 Jan 2018",
                "review_header": "Loving Alexa!"
            },
            {
                "review_text": "We initially got this to match up with our new ecobee thermostat. We never expected how much we'd enjoy Alexa. We've looked at Siri and Google and decided the Dot was better for us than even the regular full size echo. Why? Like the Google unit, it was small and didn't take up much space. I could be matched with our favorite bluetooth speakers and it can disappear behind something and still do its job. I think the only part I wish it had available was a battery. While this too can be solved by simply using a cell phone charger, it would have been nice to have it have a replaceable battery. The reason for 4 instead of 5 is the hope that Amazon will see this an consider this as an option for the future. Other than that, it really is a 5 star product.",
                "review_rating": "4.0 ",
                "review_posted_date": "26 Dec 2017",
                "review_header": "Really 5 Stars"
            },
            {
                "review_text": "For the price yes! At first I wanted to throw Alexa (Like she was real) because her repeated remarks \"I can not find this or find that\". Made me crazy. Had I listened to one reviewer who said to voice train her in which I am also saying (Use The Voice Training With Alexa first)! Then read the skills you enable and how to use them and what they do. They each have a specific invocation you must use in order for Alexa to understand what you want. She can do so much more then most know. I would recommend one read a Kindle book or a training manual for humans on the Echo Dot! Truly she is the beginning of a new way of living. The algorithms used with the Dot have not yet taught Alexa how to think more like the one using it. A real interaction which will come soon enough. I suggest everyone get a Echo or Echo Dot since eventually you will need to know how to use them for something! Technology has been and will only continue to become a much bigger part of our future. Trust me! Ech Dot plays music, reads books, briefs you on the news you enable through the skills, tells jokes, gives you uplifting quotes, great alarm, reminders, list maker and lullaby producer with the white noise sounds. Echo Dot .... after you buy the right products to use in your house for the lights, tv, thermostat and fans, garage door, cameras and whatever else I do not know about... will turn things on, off, up, down and gaurd your home and keep your house temperature as you want. Pretty neat. Iphone can do much off this stuff already yet falls short in other needed ways. Alexa is fun and a great gift for anyone who is elderly, depressed, handicapped or for animals and children who will need to understand how to use this technology. Children get a hoot out of her. When your spouse or partner is upset and giving you the silent treatment you always have Alexa to use! Enable skills like Auto Voice, Reverb and others that enable you to use Dot through your phone,tablets and other devices!!! These skills enable so much more to be done without needing to be near the Dot.",
                "review_rating": "5.0 ",
                "review_posted_date": "23 Jun 2017",
                "review_header": "Echo Dot... Very Interactive and Useful"
            },
            {
                "review_text": "I have two. I have so many stereos that buying another speaking is inconceivable. This eliminates the need to add another speaker. While my Denon has not yet be utilized with Alexa, my wife's Philips stereo which is probably a decade old sounds great. For months I'd been wondering what we should do with this stereo I married into. 'Thought of bluetooth adapters and had one for a while but it didn't really seem like it was very usable without the occasional headache and arbitrary tasks. So I see the echo and think... 'I wish they had one that didn't have a speaker', and blam Amazon reads my mind. Eventually bought one, second gen. I have never been happier with a robot. I use it for my Tea. 'Echo set timer a for 3 minutes' 3 minutes starting now. (steep time) 'Echo set a timer for 6 minutes' cool time. I use it for pizza timers. Echo set a timer for 10-20 minutes I use it for cooking times for bacon. Echo set a timer for 6 minutes and 30 seconds (then flip, on heat 7) Funny hack is that you can say a random word and Alexa will translate it to a number. 'Alexa set a timer for fish minutes' - Timer for 'fifteen' minutes starting now. I now abbreviate fifteen with 'fish' thanks to Alexa. Flash briefing. Great addition to a quiet room. On Amazon you can find these ten dollar colored lights and they work great with echo. They do not do yellow, that's the only limitation. I don't mind. 'Echo make all lights blue'. What's funny is I also have a poltergeist. I love the thing. I've never been happier because I have an acquaintance that opens cabinets and changes the times on all the appliances. Normally I'd be scared **less but it's easy to police the thing with Alexa. 'Echo turn on George Benson Radio'. No hauntings after that. I just leave it on like my house is a clothing store. The ghosts loves it and simply keeps my house cool during the summer. One night I was going to sleep and forgot to turn it on and was reminded with an open tape deck. I guess if you've been dead for a while you'd have no idea that stereos were now controlled by auditory commands and not tape decks. Music on the thing is great. I have a Amazon music unlimited subscription, it doesn't have everything but it's great, I love being able to quickly hear a theme song or play my more known favorites. I say 'Echo' to it because you can set it in the Alexa App. My upstairs echo dot is Alexa, downstairs is Echo. Upstairs is simple, the most decrepit stereo I have hooked up to a dot. It sounds just like the good old days because the auxiliary is through the tape deck itself. Since the stereo's tape function was rendered useless after I kept the aux cable turning the motors, all the thing does is accept aux cable now. What a perfect place for a dot, was my thought. I'm not even sure of the brand but it looks like an early aught ghetto blaster revival. Sounds like my old sony back in the day and it makes for a killer nostalgia sound. All these new fangled crisp audio devices? Where's the kitsch? Well the dot is one way to upgrade that mass of circuits, motors, and wires-into on of the few pinnacles of the 21st century. You can lay still and play through your favorite classics and listen to the flash briefing like the old days except you don't have to call in the station to hear your song. Just ask Alexa. Mostly they have everything but if you don't just bluetooth your phone. Bluetooth. Just connect your phone and play your Google Music collection. There's a way to get the device to play through your google music library but even for me, someone who likes tangling their mind through stupid hacks like those, I found it a lot more simple and easier to use bluetooth and the play music app. Mostly I use it for rare favorites that Alexa doesn't have. This doesn't bother me and in fact the shuffle feature from the phone is how I've been discovering new music - the aux cable is needed although I like them for Dj'ing. Macbook bluetooth. My daughter sits by echo and watches Amazon prime video. Since echo is above the laptop she's watching, I just say, 'Echo connect to macbook'. And bam word world, shaun the sheep, Daniel tiger, all playing through the philips. Computer for the blind. This is a computer for the blind. And the paralyzed. Amazing featured for someone whom is disabled. The thought of this almost makes me teary eye'd. Cyberpunk. It's definitely cyberpunk. I always imagined that's how cyberpunks operated. Philip K Dick-like with pre-existing video phones-with auditory computers - Or cyber-scholar. It's also a dictionary. Gives you random facts if you want. Ability to hear from a distance. It's actually a little nerfed I think after it was picking up the noise too readily. Funny how you tell people about it and it'll chime in like you want something. That can get a little annoying but it happen so seldom it's more like comedy. Capitals, geography. It's another scholar feature I use. Helps tremendously and I don't have to google anything. Alarms. Since I have Alexa in my upstairs now, I can wake myself up with it. A lot easier than the iphone which I forget to set a lot. Although I have them both as backups for each other. You can program a text based RPG or a Choose your own adventure. Just get an Amazon developer account. This would be a fun project. Talk through an adventure. Volume. 'Echo set volume 1-10' great feature. 'Alexa go into pairing mode', \"Searching\" then connect with your phone. Works with ha-bridge. I have that setup on my orange pi. It does nothing yet but in case I get any philips stuff. Connected to an additional raspberry pi that's offline atm. Store hours. Find what time a store closes. Emails. Really a tremendously great computerized device. I recommend for anyone seeking to add functioning to their already existing stereos without the need to configure bluetooth as often. Not buggy at all. Sometime she doesn't hear you but just think of how often people ask you to repeat yourself. A lot of the time it's a speech impediment. I do mumble and she has caused me to speak a little clearer. Probably a good thing.",
                "review_rating": "5.0 ",
                "review_posted_date": "24 Jun 2018",
                "review_header": "So many things to do. Modern day Commodore 64 for the blind. That innovative."
            },
            {
                "review_text": "I really loved this device the first few months I had it and was ready to purchase more in this collection (Big Echo, Show, etc.) However, about 6 weeks ago my echo lost the ability to pause and play, which is very frustrating . If I leave the room and tell it to pause, I want the device to be able to pick up exactly where it left off when I reenter and say \"Play\". Instead, it will restart the program, say \"Sorry, I don't know that\", or play an alternative that has nothing to do with the song, podcast, or news briefing that I was just listening to... I've called customer service a couple of times and the first time I was told to update the device (which did not help) and the second to restore it to factory conditions (which did help temporarily, but it stopped working again within 24 hours). Nevertheless, the problem persists and it's too late for me to return the device and very likely too expensive to send it anywhere to be fixed. Now I'm thinking... well, I've already lost $50, I'm not going to spend nearly $200 if my next Echo stops working a few months down the line and there's no way to return it or have it repaired in a cost-effective manner.",
                "review_rating": "1.0 ",
                "review_posted_date": "12 Oct 2017",
                "review_header": "I really loved this device the first few months I had it ..."
            },
            {
                "review_text": "I have some experience with the Original Amazon Echo which is partly what lead me to getting the Echo Dot Gen2. I liked that the Echo was very responsive and could give me news updates as well as play music. When the Echo Dot came out I looked at getting it but was hesitant to order because I wasn't sure what kind of use I would get from it and while I liked the original Echo, I didn't want to buy a lesser version. When the Dot Gen2 released I finally decided that I would give it a shot. My uses have been somewhat limited so far based on what I use it for and what other things that I have that can be controlled by it, so this will be the beginning of an ongoing review. I've been using the Echo Dot for a few weeks now and so far I really like it. I do feel that it isn't quite as good at responding that the original is but this could be due to location and room acoustics in my bedroom with other noises like the television being closer. It isn't bad by any means but I did move it next to the bed to isolate it from other sounds and that seems to have helped a lot. I didn't expect much from the speaker from such a small device that isn't a dedicated speaker but I was pleasantly surprised at just how good it was. The speaker is fairly loud and generally clear at most volumes. I feel it is good enough for music playback for casual listening but wouldn't use it for get-togethers. In the end I bought an external Bluetooth speaker(Anker Premium Wireless speaker) and it is a great pairing. It improves music playback by a lot and the sound is just better overall. Currently my main uses for the Dot have been music, news, timers, alarms, general questions, and even controlling my television. For music I have it connected to Pandora and it is very fast and simple to get a Pandora radio station playing. You can also very easily turn the volume up or down or have it connect to your phone for music playback. It also has Tune In radio which features playlists for some of my favorite podcasts. I get my news feed from NPR but there are a variety of options for where to get the news, even tech sites like Engadget. I use it constantly for alarms and timers and it is as simple as asking Alexa to set them up or stop. Sometimes in the morning when I have more difficulty reading a clock face I'll just ask Alexa for the time. It is great for setting timers for laundry or cooking and would be a great handsfree companion in the kitchen. I have recently found that it can \"control\" my Samsung television. Currently in conjunction with my Logitech Harmony Hub it can turn it on and off, thus the \"control.\" I have heard that pairing it with the Logitech Harmony Hub as well as Samsung Smart Things Hub can give me control over changing the channel and volume but I do not own the Smart Things Hub and it seems like a lot to ask. I'd really like to see something like this simplified but I understand that this cannot just come from Alexa's end and would require support from television manufacturers. Yes it is simple enough to control the tv with the remote but it actually turns out to be convenient to do a lot with your voice like setting sleep functions or changing the source. Turning the tv on and off is limited but kind of cool. There are a lot of apps and devices that the Echo has access to so I'd suggest researching what kind of smart home devices it can control or what apps it has access to that are relevant to you. I don't have any smart bulbs or sockets currently but since getting the Echo I have started looking into them. Also there seem to be a good variety of apps but I haven't really delved into them enough to use or make suggestions. I did recently download the Jeopardy game which initially worked very well but has become somewhat frustrating to play due to the game not hearing my answer and saying that it was incorrect and the correct answer is the one I just gave. This is beyond a minor gripe because everything else I use it for so far works great. I think devices like the Echo will improve a lot over time and I just hope smart controllable functionality will be safely built into more devices without having to own a variety of different hubs or controls. For something still somewhat in its infancy, the Echo is capable of a lot and works very well in what it does. There are going to be issues and hiccups here and there but that is expected. If you were to just use this for pandora, the news, alarms, and a timer I think I could still recommend it. For $40-$50 you get a lot that works well in this device. The audio quality is capable enough for most uses and it just works well in these areas. If you have a lot of devices you want to control and apps you want to use I'd suggest doing a good bit of research first to make sure it does what you intend it to and it does it consistently. The Echo Dot 2 is far from perfect. It doesn't always pick up my voice or what I say correctly and it will always be limited by its apps or other devices. Regardless of its shortcomings it is a surprisingly good device that works far more than it doesn't and it is continuing to grow every day. For the very reasonable price and it's functionality I can only give it 5 stars and recommend it to anyone that can see its usefulness in their lives.",
                "review_rating": "5.0 ",
                "review_posted_date": "27 Nov 2016",
                "review_header": "Well Priced Smart Device for a Little Bit of Everything"
            }
        ],
        "url": "https://www.amazon.com/All-New-Amazon-Echo-Dot-Add-Alexa-To-Any-Room/product-reviews/B01DFKC2SO/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1",
        "ratings": {
            "1 star": "7%",
            "3 star": "8%",
            "2 star": "4%",
            "5 star": "66%",
            "4 star": "15%"
        },
        "price": "",
        "name": "Echo Dot (2nd Generation) - Smart speaker with Alexa - Black"
    }
]